---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateVerticalHeadersInSection(Autodesk.Revit.DB.SectionType,System.Boolean)
source: html/cfee3750-8e7f-a593-7adc-702f56b0a9c1.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateVerticalHeadersInSection Method

Sets if this header should have vertical text

## Syntax (C#)
```csharp
public void UpdateVerticalHeadersInSection(
	SectionType sectionType,
	bool bVertical
)
```

## Parameters
- **sectionType** (`Autodesk.Revit.DB.SectionType`) - The section type
- **bVertical** (`System.Boolean`) - Whether headers are vertical or not

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration